arduino/ArduinoCore-sam/boards.txt
motionbow.name=Motionbow
motionbow.vid.0=0x2341
motionbow.pid.0=0x003e
motionbow.upload.tool=bossac
motionbow.upload.protocol=sam-ba
motionbow.upload.maximum_size=262144
motionbow.upload.use_1200bps_touch=true
motionbow.upload.wait_for_upload_port=true
motionbow.upload.native_usb=true
motionbow.build.mcu=cortex-m4
motionbow.build.f_cpu=120000000ul
motionbow.build.usb_manufacturer="LaserX"
motionbow.build.usb_product="laserX bow"
motionbow.build.board=MOTIONBOW
motionbow.build.core=arduino
motionbow.build.extra_flags=-D__SAM4S4A__ -mthumb {build.usb_flags}
motionbow.build.ldscript=linker_scripts/gcc/flash.ld
motionbow.build.variant=motionbow
motionbow.build.variant_system_lib=libsam_sam4s4a_gcc_rel.a
motionbow.build.vid=0x2341
motionbow.build.pid=0x003e

sam4e8e.name=SAM4E8E
sam4e8e.vid.0=0x2341
sam4e8e.pid.0=0x003e
sam4e8e.upload.tool=bossac
sam4e8e.upload.protocol=sam-ba
sam4e8e.upload.maximum_size=262144
sam4e8e.upload.use_1200bps_touch=true
sam4e8e.upload.wait_for_upload_port=true
sam4e8e.upload.native_usb=true
sam4e8e.build.mcu=cortex-m4
sam4e8e.build.f_cpu=120000000ul
sam4e8e.build.usb_manufacturer="LaserX"
sam4e8e.build.usb_product="laserX bow"
sam4e8e.build.board=SAM4E8E
sam4e8e.build.core=arduino
sam4e8e.build.extra_flags=-D__SAM4E8E__ -mthumb {build.usb_flags}
sam4e8e.build.ldscript=linker_scripts/gcc/flash.ld
sam4e8e.build.variant=sam4e8e
sam4e8e.build.variant_system_lib=libsam_sam4e8e_gcc_rel.a
sam4e8e.build.vid=0x2341
sam4e8e.build.pid=0x003e